app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.all

INSERT INTO "movies" ("title", "year", "description", "gender", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "gender" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["gender", "science fiction"], ["updated_at", "2019-09-16 01:17:53.082981"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_movie
      @movie = Movie.find(params[:id])